using Project.V13.Lib;
DataService ds = new DataService();
int a = 1412000000; // Китай
int b = 1380000000; // Индия
int c = 335000000; // США
int d = 277000000; // Индонезия
int e = 238000000; // Пакистан
int f = 227000000; // Нигерия
int g = 217000000; // Бразилия
int h = 173000000; // Бангладеш
int i = 147000000; // Россия
int j = 128000000; // Мексика
int k = 126000000; // Япония
int l = 114000000; // Эфиопия
int m = 102000000; // Филиппины
int n = 102000000; // Египет
int o = 89000000; // Вьетнам
int p = 85000000; // ДР Конго
int q = 82000000; // Иран
int r = 76000000; // Турция
int s = 68000000; // Германия
int t = 67000000; // Таиланд
Console.WriteLine(DataService.CalculateMax(a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, p, q, r, s, t));